In [2]:
#Memecah nilai string suatu kolom ke dalam beberapa kolom baru pada Pandas Data Frame

In [3]:
import pandas as pd, numpy as np

In [5]:
data = {'nama':['Didi Kempot', 'Gleen Fredly', 'Mbah Surip'],
       'tempat kelahiran':['Surakarta, Jawa Tengah', 'Jakarta, DKI Jakarta', 'Mojokerto, Jawa Timur' ]}
df = pd.DataFrame(data)
df

           nama        tempat kelahiran
0   Didi Kempot  Surakarta, Jawa Tengah
1  Gleen Fredly    Jakarta, DKI Jakarta
2    Mbah Surip   Mojokerto, Jawa Timur

In [ ]:
#Memecah nama depan nama belakang

In [6]:
df[['nama depan', 'nama belakang']]=df['nama'].str.split(' ', expand=True)

#expand = True mengizinkan untuk membuat kolom baru

df

           nama        tempat kelahiran nama depan nama belakang
0   Didi Kempot  Surakarta, Jawa Tengah       Didi        Kempot
1  Gleen Fredly    Jakarta, DKI Jakarta      Gleen        Fredly
2    Mbah Surip   Mojokerto, Jawa Timur       Mbah         Surip

In [ ]:
#memcah tempat lahir

In [7]:
df[['kota', 'provinsi']]=df['tempat kelahiran'].str.split(', ', expand=True)
df

,nama,tempat kelahiran,nama depan,nama belakang,kota,provinsi
0,Didi Kempot,"Surakarta, Jawa Tengah",Didi,Kempot,Surakarta,Jawa Tengah
1,Gleen Fredly,"Jakarta, DKI Jakarta",Gleen,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur